brew "antidote"
brew "autojump"
brew "bat"
brew "direnv"
brew "exiftool"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "make"
brew "python@3.12"
brew "shfmt"
brew "telnet"
brew "tree"
brew "uv"
brew "zsh"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "cursor"
cask "google-chrome"
cask "iterm2"
cask "macvim"
cask "moom"
cask "postman"
cask "sourcetree"
cask "zoom"
